2-densityFoam/testCase/WoodwardColella/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    ".*"
    {
        solver          diagonal;
    }

    //U
    //{
    //    solver          smoothSolver;
    //    smoother        GaussSeidel;
    //    nSweeps         2;
    //    tolerance       1e-09;
    //    relTol          0.01;
    //}

    //h
    //{
    //    $U;
    //    tolerance       1e-10;
    //    relTol          0;
    //}
}

PIMPLE
{
    nOuterCorrectors 2;
}

PISO
{
    nOuterCorrectors 2;
}

// ************************************************************************* //
