2-densityFoam/testCase/WoodwardColella/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue T 3.48
    volScalarFieldValue p 1000
    volVectorFieldValue U (0 0 0)
);

regions
(
    boxToCell
    {
        box (0.1 -1 -1) (0.9 1 1);
        fieldValues
        (
            volScalarFieldValue T 0.0000348
            volScalarFieldValue p 0.01
        );
    }

    boxToCell
    {
        box (0.9 -1 -1) (2 1 1);
        fieldValues
        (
            volScalarFieldValue T 0.348
            volScalarFieldValue p 100
        );
    }
);


// ************************************************************************* //
